package top.fengleifeng.question;

import top.fengleifeng.util.Constants;

/**
 * @program: leetcode-test
 * @description: 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。
 * <p>
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
 * <p>
 * 上图是一个部分填充的有效的数独。
 * <p>
 * 数独部分空格内已填入了数字，空白格用 '.' 表示。
 * <p>
 * 示例 1:
 * <p>
 * 输入:
 * [
 * ["5","3",".",".","7",".",".",".","."],
 * ["6",".",".","1","9","5",".",".","."],
 * [".","9","8",".",".",".",".","6","."],
 * ["8",".",".",".","6",".",".",".","3"],
 * ["4",".",".","8",".","3",".",".","1"],
 * ["7",".",".",".","2",".",".",".","6"],
 * [".","6",".",".",".",".","2","8","."],
 * [".",".",".","4","1","9",".",".","5"],
 * [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: true
 * 示例 2:
 * <p>
 * 输入:
 * [
 *   ["8","3",".",".","7",".",".",".","."],
 *   ["6",".",".","1","9","5",".",".","."],
 *   [".","9","8",".",".",".",".","6","."],
 *   ["8",".",".",".","6",".",".",".","3"],
 *   ["4",".",".","8",".","3",".",".","1"],
 *   ["7",".",".",".","2",".",".",".","6"],
 *   [".","6",".",".",".",".","2","8","."],
 *   [".",".",".","4","1","9",".",".","5"],
 *   [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: false
 * 解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
 * 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
 * 说明:
 * <p>
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 给定数独序列只包含数字 1-9 和字符 '.' 。
 * 给定数独永远是 9x9 形式的。
 * @author: fengleifeng
 * @create: 2020-06-08 09:45
 **/
public class Num36有效的数独 {
    public static void main(String[] args) {
        char[][] source = new char[9][9];
        for (int i = 0; i < source.length; i++) {
            for (int j = 0; j < source[0].length; j++) {
                source[i][j] = 0;
            }
        }
        /**
         * [["5","3",".",".","7",".",".",".","."],
         * ["6",".",".","1","9","5",".",".","."],
         * [".","9","8",".",".",".",".","6","."],
         * ["8",".",".",".","6",".",".",".","3"],
         * ["4",".",".","8",".","3",".",".","1"],
         * ["7",".",".",".","2",".",".",".","6"],
         * [".","6",".",".",".",".","2","8","."],
         * [".",".",".","4","1","9",".",".","5"],
         * [".",".",".",".","8",".",".","7","9"]]
         */
        source = new char[][]{
                {'5','3','.','.','7','.','.','.','.'},
                {'6','.','.','1','9','5','.','.','.'},
                {'.','9','8','.','.','.','.','6','.'},
                {'8','.','.','.','6','.','.','.','3'},
                {'4','.','.','8','.','3','.','.','1'},
                {'7','.','.','.','2','.','.','.','6'},
                {'.','6','.','.','.','.','2','8','.'},
                {'.','.','.','4','1','9','.','.','5'},
                {'.','.','.','.','8','.','.','7','9'},
        };
        Constants.printArrs(source);
        System.out.println();
        boolean result = new Num36有效的数独().isValidSudoku(source);
        System.out.println(result);
    }

    public boolean isValidSudoku(char[][] board) {

        for (int i = 0; i < board.length; i++) {

            for (int j = 0; j < board[i].length; j++) {
                char now = board[i][j];
                if (!vaild(board, i, j, now)) {
                    return false;
                }
            }
        }
        return true;
    }

    private boolean vaild(char[][] board, int r, int c, char n) {
        if(n=='.'){
            return true;
        }
        for (int i = 0; i < 9; i++) {
            // 判断行是否存在重复
            if (board[r][i] == n && i != c) {
                return false;
            }
            // 判断列是否存在重复
            if (board[i][c] == n && i != r) {
                return false;
            }
            // 判断 3 x 3 方框是否存在重复
            int x = (r / 3) * 3 + i / 3;//防止溢出
            int y = (c / 3) * 3 + i % 3;
            if (board[x][y] == n) {
                if (x != r || y != c) {
                    return false;
                }
            }
        }
        return true;
    }

}
